// Урок 1: Введение в JavaScript
// Задание: Напишите в консоль, что такое JavaScript и где он используется.
// Ваш код здесь

console.log("Изначально JavaScript был создан Бренданом Эйхом из Netscape и впервые был анонсирован в пресс-релизе Netscape в 1995 году. У него странная история с названием: изначально создатель назвал его Mocha, а позже переименовал в LiveScript. В 1996 году, примерно через год после выпуска, NetScape решила переименовать его в JavaScript в надежде извлечь выгоду из сообщества Java (хотя JavaScript не имел никакого отношения к Java) и выпустила Netscape 2.0 с официальной поддержкой JavaScript.")